#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Для подсистемы "Варианты отчетов" при работе в модели сервиса.
Функция ВариантыНастроек() Экспорт
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Имя, Представление", "Основной", НСтр("ru = 'Демо: Динамика изменений файлов'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "Дополнительный1", НСтр("ru = 'Демо: Дополнительный 1'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "Дополнительный2", НСтр("ru = 'Демо: Дополнительный 2'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "Дополнительный3", НСтр("ru = 'Демо: Дополнительный 3'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "Дополнительный4", НСтр("ru = 'Демо: Дополнительный 4'")));
	Возврат Результат;
КонецФункции

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	НастройкиОтчета.Размещение.Удалить(Метаданные.Подсистемы._ДемоОрганайзер.Подсистемы._ДемоРаботаСФайлами);
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Динамика изменений файлов в виде графика.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ХранитьФайлыВТомахНаДиске");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы._ДемоОрганайзер.Подсистемы._ДемоВариантыОтчетов, "Важный");
	
	// Скрытие варианта отчета настройкой разработчика.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Дополнительный1");
	НастройкиВарианта.Описание = НСтр("ru = 'Дополнительный 1.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
	// Скрытие варианта отчета настройкой администратора.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Дополнительный2");
	НастройкиВарианта.Описание = НСтр("ru = 'Дополнительный 2.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
	// Скрытие варианта отчета настройкой пользователя.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Дополнительный3");
	НастройкиВарианта.Описание = НСтр("ru = 'Дополнительный 3.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
	// Отключение варианта отчета.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Дополнительный4");
	НастройкиВарианта.Описание = НСтр("ru = 'Дополнительный 4.'");
	НастройкиВарианта.Включен = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли