////////////////////////////////////////////////////////////////////////////////
// Подсистема "Центр мониторинга".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область РаботаСПараметрамиЦентраМониторинга

Функция ПолучитьПараметрыПоУмолчанию() Экспорт
	Возврат ЦентрМониторингаСлужебный.ПолучитьПараметрыПоУмолчанию(); 
КонецФункции

Функция ПолучитьПараметрыЦентраМониторинга(Параметры = Неопределено) Экспорт
	Возврат ЦентрМониторингаСлужебный.ПолучитьПараметрыЦентраМониторинга(Параметры);
КонецФункции

Функция ЗаписыватьОперацииБизнесСтатистики() Экспорт
	ПараметрыЦентраМониторинга = Новый Структура("ВключитьЦентрМониторинга, ЦентрОбработкиИнформацииОПрограмме, РегистрироватьБизнесСтатистику");
		
	ПолучитьПараметрыЦентраМониторинга(ПараметрыЦентраМониторинга);
	
	Возврат (ПараметрыЦентраМониторинга.ВключитьЦентрМониторинга ИЛИ ПараметрыЦентраМониторинга.ЦентрОбработкиИнформацииОПрограмме) И ПараметрыЦентраМониторинга.РегистрироватьБизнесСтатистику;
КонецФункции

Функция ИспользоватьЦентрМониторинга() Экспорт
	Возврат ЦентрМониторингаСлужебный.ИспользоватьЦентрМониторинга();
КонецФункции

Функция ПолучитьПараметрыСервисаОтправки() Экспорт
	Возврат ЦентрМониторингаСлужебный.ПолучитьПараметрыСервисаОтправки();
КонецФункции

#КонецОбласти

#Область РаботаВРежимеРИБ

Функция ЭтоГлавныйУзел() Экспорт
	Возврат ЦентрМониторингаСлужебный.ЭтоГлавныйУзел();
КонецФункции

#КонецОбласти

#КонецОбласти
