#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СбросНастроек(Команда)
	СбросНастроекНаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СбросНастроекНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПроверкаКонтрагентов", 
		"ПроверкаКонтрагентов_ДатаПоследнегоОтображенияПредложенияНаВключениеСервиса", ТекущаяДатаСеанса() - 60*60*6);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПроверкаКонтрагентов", 
		"ПроверкаКонтрагентов_БольшеНеПоказыватьПредложениеИспользоватьСервис", Неопределено);
	УстановитьПривилегированныйРежим(Истина);
	
	ПроверкаКонтрагентов.ВключитьВыключитьПроверкуКонтрагентов(Ложь);

КонецПроцедуры

#КонецОбласти

