////////////////////////////////////////////////////////////////////////////////
// Подсистема "Удаление помеченных объектов".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// См. описание этой же процедуры в модуле СтандартныеПодсистемыСервер.
Процедура ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия) Экспорт
	
	// СЕРВЕРНЫЕ СОБЫТИЯ.
	
	// Вызывается после удаления помеченных объектов.
	//
	// Параметры:
	//   ПараметрыВыполнения - Структура - Контекст удаления помеченных объектов.
	//       * Удаленные - Массив - Ссылки удаленных объектов.
	//       * НеУдаленные - Массив - Ссылки объектов, которые не получилось удалить.
	//
	// Синтаксис:
	//   Процедура ПослеУдаленияПомеченных(Знач ПараметрыВыполнения) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.УдалениеПомеченныхОбъектов\ПослеУдаленияПомеченных");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Точка входа регламентного задания.
//
Процедура УдалениеПомеченныхПоРасписанию() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.УдалениеПомеченных);
	
	Обработки.УдалениеПомеченныхОбъектов.УдалитьПомеченныеОбъектыИзРегламентногоЗадания();
	
КонецПроцедуры

#КонецОбласти