#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Результат = ПередЗакрытиемНаСервере(ОтключитьОписания);
	СтандартныеПодсистемыКлиент.ПоказатьРезультатВыполнения(ЭтотОбъект, Результат);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтключитьСейчас(Команда)
	ОтключитьОписания = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПередЗакрытиемНаСервере(ОтключитьОписания)
	Результат = Новый Структура;
	
	ОбщиеНастройки = ВариантыОтчетов.ОбщиеНастройкиПанели();
	Если ОтключитьОписания Тогда
		ОбщиеНастройки.ПоказыватьПодсказки = Ложь;
	КонецЕсли;
	ОбщиеНастройки.ПоказатьОповещениеОПодсказках = Ложь;
	ВариантыОтчетов.СохранитьОбщиеНастройкиПанели(ОбщиеНастройки);
	
	СтандартныеПодсистемыКлиентСервер.ОповеститьОткрытыеФормы(
		Результат,
		ВариантыОтчетовКлиентСервер.ИмяСобытияИзменениеОбщихНастроек(),
		ОбщиеНастройки);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
